Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetChildren Method
 Returns an enumerator of all the children model objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public virtual ModelObjectEnumerator GetChildren()
Public Overridable Function GetChildren As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A model object enumerator on success, otherwise null.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace